INSERT INTO address (region, city, street, building_number, apartment_number) VALUES
    ('Московская область', 'Москва', 'Тверская', '15', 45),
    ('Республика Крым', 'Симферополь', 'Невский проспект', '28', 12),
    ('Республика Крым', 'Симферополь', 'Арбат', '10', 8),
    ('Республика Крым', 'Алушта', 'Ленина', '25', NULL),
    ('Республика Крым', 'Евпатория', 'Красный проспект', '42', 78);


INSERT INTO users (name, second_name, patronymic, phone_number, email_address, birth_date, address_id) VALUES
   ('Иван', 'Иванов', 'Иванович', '79780000001', 'ivan@example.com', '1990-05-15', 1),
   ('Петр', 'Петров', 'Петрович', '79780000002', 'petr@example.com', '1985-08-22', 2),
   ('Мария', 'Сидорова', 'Ивановна', '79780000003', 'maria@example.com', '1995-03-10', 3),
   ('Елена', 'Кузнецова', NULL, '79780000004', 'elena@example.com', '1988-11-30', NULL),
   ('Алексей', 'Смирнов', 'Алексеевич', '79780000005', 'alexey@example.com', '1992-07-18', 4);